JinxingZhou0510/embedded-source-code/stepmotor-control/bsp/stm32f10x/applications/stm32f10x_itb.c
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : stm32f10x_it.c
* Author             : MCD Application Team
* Version            : V2.0.3
* Date               : 09/22/2008
* Description        : Main Interrupt Service Routines.
*                      This file provides template for all exceptions handler
*                      and peripherals interrupt service routine.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_it.h"
#include "STM32F10X_System.h"
#include "global_varial.h"
#include "math.h"
#include "Macro.h"
//#include <ucos_ii.h>

/* Private define ------------------------------------------------------------*/
/* CAN Master Control Register bits */
#define MCR_INRQ     ((u32)0x00000001) /* Initialization request */
#define MCR_SLEEP    ((u32)0x00000002) /* Sleep mode request */
#define MCR_TXFP     ((u32)0x00000004) /* Transmit FIFO priority */
#define MCR_RFLM     ((u32)0x00000008) /* Receive FIFO locked mode */
#define MCR_NART     ((u32)0x00000010) /* No automatic retransmission */
#define MCR_AWUM     ((u32)0x00000020) /* Automatic wake up mode */
#define MCR_ABOM     ((u32)0x00000040) /* Automatic bus-off management */
#define MCR_TTCM     ((u32)0x00000080) /* time triggered communication */

/* CAN Master Status Register bits */
#define MSR_INAK     ((u32)0x00000001)    /* Initialization acknowledge */
#define MSR_WKUI     ((u32)0x00000008)    /* Wake-up interrupt */
#define MSR_SLAKI    ((u32)0x00000010)    /* Sleep acknowledge interrupt */

/* CAN Transmit Status Register bits */
#define TSR_RQCP0    ((u32)0x00000001)    /* Request completed mailbox0 */
#define TSR_TXOK0    ((u32)0x00000002)    /* Transmission OK of mailbox0 */
#define TSR_ABRQ0    ((u32)0x00000080)    /* Abort request for mailbox0 */
#define TSR_RQCP1    ((u32)0x00000100)    /* Request completed mailbox1 */
#define TSR_TXOK1    ((u32)0x00000200)    /* Transmission OK of mailbox1 */
#define TSR_ABRQ1    ((u32)0x00008000)    /* Abort request for mailbox1 */
#define TSR_RQCP2    ((u32)0x00010000)    /* Request completed mailbox2 */
#define TSR_TXOK2    ((u32)0x00020000)    /* Transmission OK of mailbox2 */
#define TSR_ABRQ2    ((u32)0x00800000)    /* Abort request for mailbox2 */
#define TSR_TME0     ((u32)0x04000000)    /* Transmit mailbox 0 empty */
#define TSR_TME1     ((u32)0x08000000)    /* Transmit mailbox 1 empty */
#define TSR_TME2     ((u32)0x10000000)    /* Transmit mailbox 2 empty */

/* CAN Receive FIFO 0 Register bits */
#define RF0R_FULL0   ((u32)0x00000008)    /* FIFO 0 full */
#define RF0R_FOVR0   ((u32)0x00000010)    /* FIFO 0 overrun */
#define RF0R_RFOM0   ((u32)0x00000020)    /* Release FIFO 0 output mailbox */

/* CAN Receive FIFO 1 Register bits */
#define RF1R_FULL1   ((u32)0x00000008)    /* FIFO 1 full */
#define RF1R_FOVR1   ((u32)0x00000010)    /* FIFO 1 overrun */
#define RF1R_RFOM1   ((u32)0x00000020)    /* Release FIFO 1 output mailbox */

/* CAN Error Status Register bits */
#define ESR_EWGF     ((u32)0x00000001)    /* Error warning flag */
#define ESR_EPVF     ((u32)0x00000002)    /* Error passive flag */
#define ESR_BOFF     ((u32)0x00000004)    /* Bus-off flag */

/* CAN Mailbox Transmit Request */
#define TMIDxR_TXRQ  ((u32)0x00000001) /* Transmit mailbox request */

/* CAN Filter Master Register bits */
#define FMR_FINIT    ((u32)0x00000001) /* Filter init mode */

/* ---------------------- TIM registers bit mask ------------------------ */
#define CR1_CEN_Set                 ((u16)0x0001)
#define CR1_CEN_Reset               ((u16)0x03FE)

void SysTickHandler(void)
{
    u8 i=0;
	systime.sysmsecond++;
	  //任务调度前的新任务拷贝
	if(StartCopyCmd==TRUE)
	{
		if(systime.sysmsecond>StartCopyCmdTime)
		{
			if((systime.sysmsecond-StartCopyCmdTime)>800)
			{
				StartCopyCmd=FALSE;	
				StartCopy=TRUE;
				//CopyNewInf();							
			}
		}
		else
		{
			if((StartCopyCmdTime+1000-systime.sysmsecond)>800)
			{
				StartCopyCmd=FALSE;
				//CopyNewInf();	
				StartCopy=TRUE;						
			}	
		}	
	}			
	 //以下是软定时器的功能，定时器的功能是专用的，采用软定时器是避免主程序中使用delay
	for(i=0;i<5;i++)
	{
	  	if(TaskTimer.m_timeron[i]==1)
	  	{
	     	TaskTimer.m_timercnt[i]++;
			if(TaskTimer.m_timercnt[i]>TaskTimer.m_timerval[i])
		 	{
		    	TaskTimer.m_timerout[i]=1;
				TaskTimer.m_timercnt[i]=0;
		 	}  
	  	}
	}
	//主程序中打开泵和阀，一段时间后执行下一个动作
	if(TaskTimer.m_timerout[0]==1)
	{
	 	TaskTimer.m_timerout[0]=0;
	 	TaskTimer.m_timeron[0]=0;

		//关闭阀门
	 	//TurnOffPump(1); GPIO_ResetBits(GPIOE,GPIO_Pin_10);
	 	//TurnOffValve(2);  GPIO_ResetBits(GPIOE,GPIO_Pin_13);
	 	//TurnOffValve(1);	GPIO_ResetBits(GPIOE,GPIO_Pin_12);
		//set GPIO	GPIOx->BSRR = GPIO_Pin;
		//reset GPIOx->BRR = GPIO_Pin;
		GPIOE->BRR=GPIO_Pin_10;	
		GPIOE->BRR=GPIO_Pin_13;
		GPIOE->BRR=GPIO_Pin_12;

		//TaskTimer.m_timercnt[0]=0;
	 	if(AddSubstrateCmd==TRUE)
	 	{
	 		AddSubstrateHandState++;
	 	}
	}
	//检测臂向下停留的时间
	if(TaskTimer.m_timerout[1]==1)
	{
	 	TaskTimer.m_timerout[1]=0;
	 	TaskTimer.m_timeron[1]=0; 
		//TaskTimer.m_timercnt[1]=0;	 	
	 	if(TestProbeDownCmd==TRUE)
	 	{
	 		TestHandState++;
	 	}
	}
	//用于电机组合控制的延时
	if(TaskTimer.m_timerout[2]==1)
	{
	 	TaskTimer.m_timerout[2]=0;
	 	TaskTimer.m_timeron[2]=0;
		TaskTimer.m_timercnt[2]=0;
		motor4.flag=0;
	 	if(AddSubstrateCmd==TRUE)
	 	{
	 		AddSubstrateHandState++;
	 	}
	}
	//主程序在一次反应盘中断后，间隔一段时间打开中断使能
	if(TaskTimer.m_timerout[3]==1)
	{
	 	TaskTimer.m_timerout[3]=0;
	 	TaskTimer.m_timeron[3]=0;
		TaskTimer.m_timercnt[3]=0;
	 	//打开外部中断
	 	Switch5Enable=TRUE;
	} 
    if(systime.sysmsecond<1000)  return;

	 if(systime.sysmsecond>=1000)
	   {
	    totalsecond++;
	    systime.syssecond++;
		SystickFlag=1;
		systime.sysmsecond=0;
	   }
	 if(systime.syssecond>=60)
	   {
	     systime.syssecond=0;
	     systime.sysminute++;
		}
	 if(systime.sysminute>=60)
	   {
	    systime.sysminute=0;
	     systime.syshour++;
	   }
	 if(systime.syshour>=60)
	   systime.syshour=0;
}
void TIM1_UP_IRQHandler(void)
{
   	//清中断
   	TIM1->SR = (u16)~TIM_FLAG_Update;
   	//TIM_ClearITPendingBit(TIM1, TIM_FLAG_Update); //清中断
   
 	//********************************************************电机4*****************************/ 
 	if(1==motor4.en)
	{ 
	   motor4.PulsesHaven++; //总脉冲个数
	   motor4.pulsecount++;  //以该频率脉冲输出的脉冲个数	
	   if(motor4.pulsecount>=motor4.Step_Table[motor4.CurrentPostion])
	   { 
		    if(motor4.PulsesHaven<=motor4.StartSteps)//起步阶段
			{
			   if(motor4.CurrentPostion<motor4.StartTableLength)
			   {
			       motor4.CurrentPostion++;
			       motor4.pulsecount=0;
			       if(motor4.CurrentPostion>=motor4.StartTableLength)motor4.CurrentPostion=motor4.StartTableLength-1;  
			   }		  
			}
			if(motor4.PulsesGiven-motor4.PulsesHaven<motor4.StopSteps) //停止阶段
			{
			   if(motor4.CurrentPostion<motor4.StartTableLength)
			   {
			     motor4.CurrentPostion=36-motor4.CurrentPostion;  
			   }
			   motor4.CurrentPostion++;
			   motor4.pulsecount=0;
			   if(motor4.CurrentPostion>=motor4.StartTableLength+motor4.StopTableLength)motor4.CurrentPostion=motor4.StartTableLength+motor4.StopTableLength-1;
			} 	
			TIM1->ARR = motor4.Counter_Table[motor4.CurrentPostion] ; //设置周期
			TIM1->CCR1 =( motor4.Counter_Table[motor4.CurrentPostion])>>1;       //设置占空比	    
	  }	 	  
	  //旋转预定脉冲数，停止，flag=0，可以进行下一次旋转
	  if(motor4.PulsesHaven>=motor4.PulsesGiven)
	  {
		     motor4.en=0;
		     motor4.flag=0;
			 TIM1->CR1 &= CR1_CEN_Reset;
			 if(AddSubstrateCmd==TRUE)
			 {
			    AddSubstrateHandState++;
			 } 
			 if(motor4.rstflg==1)         //复位标志没有被限位开关中断，复位异常
			 {
			    MotorRstException|=0x08;
			 }
	  }	
	  	  		  	 
	}//电机使能情况下的讨论结束   

