JinxingZhou0510/embedded-source-code/stepmotor-control/bsp/stm32f10x/applications/stm32f10x_itb.c
}
void TIM2_IRQHandler(void)
{    
   //TIM_ClearITPendingBit(TIM2 , TIM_FLAG_Update); 
   //清中断 
   TIM2->SR = (u16)~TIM_FLAG_Update;     

   //********************************************************电机2*****************************/
  if(1==motor2.en)
	{ 
	   motor2.PulsesHaven++; //总脉冲个数
	   StepsOfDown_TRUE++;
	   if(upstepcntcmd)
	   StepsOfDownExtra_TRUE++;
	   if(upstepcntcmd1)
	   StepsOfDownExtra_TRUE1++;
	   motor2.pulsecount++;  //以该频率脉冲输出的脉冲个数	
	  if(motor2.pulsecount>=motor2.Step_Table[motor2.CurrentPostion])
	  { 
	    if(motor2.PulsesHaven<=motor2.StartSteps)//起步阶段
		{
		   if(motor2.CurrentPostion<motor2.StartTableLength)
		   {
		  	 motor2.CurrentPostion++;
		  	 motor2.pulsecount=0;
		  	 if(motor2.CurrentPostion>=motor2.StartTableLength)motor2.CurrentPostion=motor2.StartTableLength-1;
		   }
		}
		if(motor2.PulsesGiven-motor2.PulsesHaven<motor2.StopSteps) //停止阶段
		{
		   if(motor2.CurrentPostion<motor2.StartTableLength)
		   {
		     motor2.CurrentPostion=36-motor2.CurrentPostion;  
		   }
		   motor2.CurrentPostion++;
		   motor2.pulsecount=0;
		   if(motor2.CurrentPostion>=motor2.StartTableLength+motor2.StopTableLength)
		     motor2.CurrentPostion=motor2.StartTableLength+motor2.StopTableLength-1;
		}  		
	
		TIM2->ARR = motor2.Counter_Table[motor2.CurrentPostion] ; //设置周期
		TIM2->CCR1 =( motor2.Counter_Table[motor2.CurrentPostion])>>1;       //设置占空比	    
	  }	 	      
	  
	  //旋转预定脉冲数，停止，flag=0，可以进行下一次旋转
	  if(motor2.PulsesHaven>=motor2.PulsesGiven)
	  {
	     motor2.en=0;
	     motor2.flag=0;
	     TIM2->CR1 &= CR1_CEN_Reset;
		 if(AddSubstrateCmd==TRUE)
		 {
		    AddSubstrateHandState++;
		 } 
		
		 if(motor2.rstflg==1)         //复位标志没有被限位开关中断，复位异常
		 {
		    MotorRstException|=0x02;
		 }
	  }	
	  	  		  	 
	}//电机使能情况下的讨论结束
}

void TIM3_IRQHandler(void)
{    
   //TIM_ClearITPendingBit(TIM2 , TIM_FLAG_Update); 
   //清中断 
   TIM3->SR = (u16)~TIM_FLAG_Update;     

   //********************************************************电机2*****************************/
  if(1==motor3.en)
	{ 
	   motor3.PulsesHaven++; //总脉冲个数
	   motor3.pulsecount++;  //以该频率脉冲输出的脉冲个数	
	  if(motor3.pulsecount>=motor3.Step_Table[motor3.CurrentPostion])
	  { 
	    if(motor3.PulsesHaven<=motor3.StartSteps)//起步阶段
		{
		   if(motor3.CurrentPostion<motor3.StartTableLength)
		   {
		  	 motor3.CurrentPostion++;
		  	 motor3.pulsecount=0;
		  	 if(motor3.CurrentPostion>=motor3.StartTableLength)motor3.CurrentPostion=motor3.StartTableLength-1;
		   }
		}
		if(motor3.PulsesGiven-motor3.PulsesHaven<motor3.StopSteps) //停止阶段
		{
		   if(motor3.CurrentPostion<motor3.StartTableLength)
		   {
		     motor3.CurrentPostion=36-motor3.CurrentPostion;  
		   }
		   motor3.CurrentPostion++;
		   motor3.pulsecount=0;
		   if(motor3.CurrentPostion>=motor3.StartTableLength+motor3.StopTableLength)
		     motor3.CurrentPostion=motor3.StartTableLength+motor3.StopTableLength-1;
		}  		
	
		TIM3->ARR = motor3.Counter_Table[motor3.CurrentPostion] ; //设置周期
		TIM3->CCR1 =( motor3.Counter_Table[motor3.CurrentPostion])>>1;       //设置占空比	    
	  }	 	      
	  
	  //旋转预定脉冲数，停止，flag=0，可以进行下一次旋转
	  if(motor3.PulsesHaven>=motor3.PulsesGiven)
	  {
	     motor3.en=0;
	     motor3.flag=0;
	     TIM3->CR1 &= CR1_CEN_Reset;
		 if(TestProbeDownCmd==TRUE)
		 {
		    TestHandState++;
		 } 
		 if(motor3.rstflg==1)         //复位标志没有被限位开关中断，复位异常
		 {
		    MotorRstException|=0x04;
		 }
	  }	
	  	  		  	 
	}//电机使能情况下的讨论结束
}

#if 0
void TIM3_IRQHandler(void)
{    
    TIM3->SR = (u16)~TIM_FLAG_Update;
    //GPIO_ResetBits(GPIOA,GPIO_Pin_6);                                                        //复位时钟信号
    GPIOA->BRR = GPIO_Pin_6;
	if(motor3.ActualVelocity!=motor3.TargetVelocity)
    {
      	motor3.VelAccumulator+=motor3.ActualAcceleration;       
      	motor3.VelAdd = motor3.VelAccumulator >> 17;            
      	motor3.VelAccumulator-=motor3.VelAdd << 17;
      	if(motor3.ActualVelocity<motor3.TargetVelocity)
       	{
       		motor3.ActualVelocity=MIN(motor3.ActualVelocity+motor3.VelAdd, motor3.TargetVelocity);
       	}
      	else if(motor3.ActualVelocity>motor3.TargetVelocity)
       	{
         	motor3.ActualVelocity=MAX(motor3.ActualVelocity-motor3.VelAdd, motor3.TargetVelocity);
       	}
    }
   	else
    {
      	motor3.VelAccumulator=0;
      	motor3.VelAdd=0;
    }
    switch(motor3.RampState)
    { 
      	case RAMP_IDLE:                                                    
	        if(motor3.ActualPosition<motor3.TargetPosition)        
	        {
	          motor3.TargetVelocity=motor3.MaxPositioningSpeed;
	          motor3.RampState=RAMP_ACCELERATE;
	          motor3.AccelerationSteps=motor3.ActualPosition;
	        }
	        else if(motor3.ActualPosition>motor3.TargetPosition)   
	        {
	          motor3.TargetVelocity=-motor3.MaxPositioningSpeed;
	          motor3.RampState=RAMP_ACCELERATE;
	          motor3.AccelerationSteps=motor3.ActualPosition;
	        }
        	break;
      case RAMP_ACCELERATE:                                            
	        if(abs(motor3.ActualVelocity)==motor3.MaxPositioningSpeed)
	        {                                                              
	          motor3.AccelerationSteps=abs(motor3.ActualPosition-motor3.AccelerationSteps)+1;
	          motor3.RampState=RAMP_DRIVING;
	        }
	        else if(abs(motor3.ActualPosition-motor3.AccelerationSteps)>=abs(motor3.TargetPosition-motor3.ActualPosition))   
	        {                                                              
	          motor3.TargetVelocity=0;
	          motor3.RampState=RAMP_DECELERATE;
	        }
	        break;	 
      case RAMP_DRIVING:                                               
	       if((abs(motor3.TargetPosition-motor3.ActualPosition) <= motor3.AccelerationSteps) ||
	           ((motor3.TargetVelocity<0) && (motor3.ActualPosition<motor3.TargetPosition)) ||
	           ((motor3.TargetVelocity>0) && (motor3.ActualPosition>motor3.TargetPosition)))
	        {                                                              
	          motor3.TargetVelocity=0;
	          motor3.RampState=RAMP_DECELERATE;
	        }
	        break;
      case RAMP_DECELERATE:   
	        if(motor3.ActualPosition==motor3.TargetPosition)
	        {                                                              
	          motor3.TargetVelocity=motor3.ActualVelocity=0;
	          motor3.RampState=RAMP_IDLE;
	        }
	        if(motor3.ActualVelocity==0)                              
	        {
	          motor3.RampState=RAMP_IDLE;
	          if(motor3.ActualPosition==motor3.TargetPosition) 
	          {
	             motor3.TargetReachedFlag=TRUE;
	             motor3.flag=0;
				 TIM3->CR1 &= CR1_CEN_Reset;
				 if(TestProbeDownCmd==TRUE)
				 {
				    TestHandState++;
				 } 
				
				 if(motor3.rstflg==1)         //复位标志没有被限位开关中断，复位异常
				 {
				    MotorRstException|=0x04;
				 }
	             
