JinxingZhou0510/embedded-source-code/stepmotor-control/bsp/stm32f10x/applications/stm32f10x_itb.c
	          }
	        }
	        break;
    }
    motor3.PosAccumulator += motor3.ActualVelocity;            
	motor3.PosAdd = motor3.PosAccumulator >> 17;               
	motor3.PosAccumulator -= motor3.PosAdd << 17;
  	if(motor3.PosAdd==0) 
    	return;                                                            
    else
    {
    	motor3.ActualPosition+=motor3.PosAdd;
    	//GPIO_SetBits(GPIOA,GPIO_Pin_6);                                                //产生上升沿脉冲
		GPIOA->BSRR = GPIO_Pin_6;
		/*
    	if((Motor_Sample_flag)&(Motor_Sample.type_state==1))                                        //复位
	      {
	        Motor_Sample.ActualPosition=Motor_Sample.TargetPosition=0;
	        Motor_Sample.RampState=RAMP_IDLE;
	        Motor_Sample.TargetVelocity=Motor_Sample.ActualVelocity=0;
	        Motor_Sample.flag=0;
	        TIM_Cmd(TIM3, DISABLE);                                                                  //电机停止运行 
	      }
		  */
    }
 }
 #endif

 void TIM4_IRQHandler(void)
{
 
   //TIM_ClearITPendingBit(TIM4 , TIM_FLAG_Update);      
   TIM4->SR = (u16)~TIM_FLAG_Update;
   //********************************************************电机1*****************************/
  if(1==motor1.en)
	{ 
	   motor1.PulsesHaven++; //总脉冲个数
	   motor1.pulsecount++;  //以该频率脉冲输出的脉冲个数	
	  if(motor1.pulsecount>=motor1.Step_Table[motor1.CurrentPostion])
	  { 
	    
	    if(motor1.PulsesHaven<=motor1.StartSteps)//起步阶段
		{
		   if(motor1.CurrentPostion<motor1.StartTableLength)
		   {
		   	  motor1.CurrentPostion++;
		      motor1.pulsecount=0;
		      if(motor1.CurrentPostion>=motor1.StartTableLength)motor1.CurrentPostion=motor1.StartTableLength-1;
		   }
		}
		if(motor1.PulsesGiven-motor1.PulsesHaven<motor1.StopSteps) //停止阶段
		{
		   if(motor1.CurrentPostion<motor1.StartTableLength)
		   {
		     motor1.CurrentPostion=142-motor1.CurrentPostion;
		   }
		  motor1.CurrentPostion++;
		  motor1.pulsecount=0;
		  if(motor1.CurrentPostion>=motor1.StartTableLength+motor1.StopTableLength)
		     motor1.CurrentPostion=motor1.StartTableLength+motor1.StopTableLength-1;
		}  		
	
		TIM4->ARR = motor1.Counter_Table[motor1.CurrentPostion] ; //设置周期
		TIM4->CCR1 =( motor1.Counter_Table[motor1.CurrentPostion])>>1;       //设置占空比	    
	  }	 	      
	  
	  //旋转预定脉冲数，停止，flag=0，可以进行下一次旋转
	  if(motor1.PulsesHaven>=motor1.PulsesGiven)
	  {
	     motor1.en=0;
	     motor1.flag=0;
	     TIM4->CR1 &= CR1_CEN_Reset;
		 if(AddSubstrateCmd==TRUE)
		 {
		    AddSubstrateHandState++;
		 } 		
		 if(motor1.rstflg==1)         //复位标志没有被限位开关中断，复位异常
		 {
		    MotorRstException|=0x01;
		 }
	  }	
	  	  		  	 
	}//电机使能情况下的讨论结束
  
}
void TIM8_UP_IRQHandler(void)
{
 	TIM8->SR = (u16)~TIM_FLAG_Update;
	testtimer5=1;
}	 
void EXTI0_IRQHandler(void)
{
  u32 enablestatus = 0;   
  enablestatus =  EXTI->IMR & EXTI_Line0;
  if (((EXTI->PR & EXTI_Line0) != (u32)RESET) && (enablestatus != (u32)RESET))
  {       
	 //EXTI_ClearITPendingBit(EXTI_Line0);   //先将中断清零，否则是BUG
	 EXTI->PR = EXTI_Line0;
	 if(FALSE==Switch1Enable)
	    return;
	 
	 Switch1Enable=FALSE;   //进入中断处理，关闭使能，由Systick经过一段时间后打开
     EXTIFlag++;
	 //if(EXTIFlag==1)TurnOnLED(1);
	 //if(EXTIFlag==2)TurnOnLED(2);
     EXTINum=1;
     if(motor1.rstflg==1)
     {   
	    motor1.PulsesHaven=motor1.PulsesGiven-PCMCVarial.PCMCmotor1.PCMCM1RstAfter; 		 	     
		motor1.rstflg=0;
	 } 		 	 
  }	 
}

void EXTI1_IRQHandler(void)
{
   u32 enablestatus = 0;    
   enablestatus =  EXTI->IMR & EXTI_Line1;
   if (((EXTI->PR & EXTI_Line1) != (u32)RESET) && (enablestatus != (u32)RESET))
   { 
      //EXTI_ClearITPendingBit(EXTI_Line1);
	  EXTI->PR = EXTI_Line1;
	  if(FALSE==Switch2Enable)
	    return;
	  Switch2Enable=FALSE;   //进入中断处理，关闭使能，由Systick经过一段时间后打开
      EXTIFlag++;
      EXTINum=2;
      if(motor2.rstflg==1)
     {
	    motor2.PulsesHaven=motor2.PulsesGiven-PCMCVarial.PCMCmotor2.PCMCM2RstAfter;
		 //TIM_Cmd(TIM2, DISABLE);		  //DISABLE
       // motor2.en=0; //停止电机2
       // motor2.flag=0; //但是电机旋转标志要清零，留给其他用途
	   motor2.rstflg=0;
	  
     }
   }  
}

void EXTI2_IRQHandler(void)
{
    u32 enablestatus = 0;   
   	enablestatus =  EXTI->IMR & EXTI_Line2;
   	if (((EXTI->PR & EXTI_Line2) != (u32)RESET) && (enablestatus != (u32)RESET))
    { 
	   
	   //EXTI_ClearITPendingBit(EXTI_Line2);
	   EXTI->PR = EXTI_Line2;
	   if(FALSE==Switch3Enable)
	    return;
	   Switch3Enable=FALSE;   //进入中断处理，关闭使能，由Systick经过一段时间后打开
       EXTIFlag++;
       EXTINum=3;
       if(motor3.rstflg==1)
	   {
	       motor3.PulsesHaven=motor3.PulsesGiven-(PCMCVarial.PCMCmotor3.PCMCM3RstAfter);//20000;//PCMRVarial.PCMRmotor3.PCMRM3RstAfter;;	 //范围25000-32000
		   TurnOnLED(1);
	       //motor3.en=0; //停止电机3
	       //motor3.flag=0; //但是电机旋转标志要清零，留给其他用途
		   motor3.rstflg=0;
	   }
    }
}

void EXTI4_IRQHandler(void)
{
   u32 enablestatus = 0;   
   enablestatus =  EXTI->IMR & EXTI_Line4;
   if (((EXTI->PR & EXTI_Line4) != (u32)RESET) && (enablestatus != (u32)RESET))
   { 
       
	   //EXTI_ClearITPendingBit(EXTI_Line4);
	   EXTI->PR = EXTI_Line4;
	   if(FALSE==Switch4Enable)
	    return;
	 Switch4Enable=FALSE;   //进入中断处理，关闭使能，由Systick经过一段时间后打开
     EXTIFlag++;
     EXTINum=4;  
	 if(motor4.rstflg==1)
	 {
	     motor4.PulsesHaven=motor4.PulsesGiven-128;
	     //motor4.en=0; //停止电机4
	     //motor4.flag=0; //但是电机旋转标志要清零，留给其他用途
		 motor4.rstflg=0;
	 }  
  }
}

void EXTI9_5_IRQHandler(void)
{
   //主盘触发
   u32 enablestatus = 0;   
   enablestatus =  EXTI->IMR & EXTI_Line5;
   if (((EXTI->PR & EXTI_Line5) != (u32)RESET) && (enablestatus != (u32)RESET))
   { 
	   //EXTI_ClearITPendingBit(EXTI_Line5);
	   EXTI->PR = EXTI_Line5;
	   if(FALSE==Switch5Enable)
	    return;
      Switch5Enable=FALSE;   //进入中断处理，关闭使能，由Systick经过一段时间后打开
      EXTIFlag++;
      EXTINum=5; 
	 // if(StartTest==TRUE)
	  {
	   ReactionPlateCome=TRUE; 
	  }   
   }
}
void EXTI3_IRQHandler(void)
{
   unsigned int tmp=0,tmp1=0,i;
   	u32 enablestatus = 0;   
   	enablestatus =  EXTI->IMR & EXTI_Line3;
   	if (((EXTI->PR & EXTI_Line3) != (u32)RESET) && (enablestatus != (u32)RESET))
   	{ 		 
	      //EXTI_ClearITPendingBit(EXTI_Line3);
		  //清中断
		  EXTI->PR = EXTI_Line3;
		  if(FALSE==Switch6Enable)
		  {
		     	return; 
		  }		    
		  Switch6Enable=FALSE;        //进入中断处理，关闭使能，由Systick经过一段时间后打开
	
		  if((LiquidIntEnable==FALSE)&&(CollisionIntEnable==FALSE))  //机械臂不是在下降时产生的中断，直接返回
		  {
		     	return;
		  }
		  if(LiquidIntEnable==TRUE)
		  {
		      //关闭定时器2
		  	  TIM2->CR1 &= CR1_CEN_Reset;
		      //LiquidInt++;
			  LiquidIntEnable=FALSE;      //响应一次中断后立马关闭
			  if(motor2.en==0)
			  {
			  	 TIM2->CR1 |= CR1_CEN_Set;	
			     return;		
			  }	 
			 
			  StepsOfDown=motor2.PulsesHaven;  //记录下降的步数	
			  StepsOfDown1= motor2.PulsesHaven; 
			  if(StepsOfDown<=MAXSUBSHIGH)
			  {
				 TIM_Cmd(TIM3, DISABLE);	
				 TIM_Cmd(TIM4, DISABLE);
				 TIM_Cmd(TIM1, DISABLE);
				 TIM_Cmd(TIM2, DISABLE);
				 TurnOnLED(1);
				 while(1);
			  }
			  //StepsOfDown_TRUE=motor2.PulsesHaven;
			   
			  StepsOfDown_TRUE1=StepsOfDown_TRUE;
			  StepsOfDown_TRUE=0;
			  StepsOfDownExtra_TRUE=0;
			  upstepcntcmd=1;
			  tmp=9*PCMCVarial.PCMCmotor2.PCMCM2ReaLiqAfterDown;
			  StepsOfDown+=tmp;
			  StepsOfDown1+=tmp;
			  motor2.PulsesHaven=motor2.PulsesGiven-tmp; 
			  pos1=motor2.CurrentPostion; 
			 
			  //以下是防止液面很低，电机到达液面时已经减速，这时还要减速，电机的运行速度就慢了
			  if(tmp>motor2.StopSteps)     //还要运行的步数大于减速步数
			  {
					if(motor2.CurrentPostion>18) //此时进入减速状态
					{
						//motor2.CurrentPostion=36-motor2.CurrentPostion; //这样处理，如果CurrentPostion=11,速度很慢，而这时既不满足加速条件，也不满足减速条件，会一直以低速运行
						motor2.CurrentPostion=18;
					}
			  }
			  else
			  {
					tmp1=0;
					for(i=24;i>0;i--)
					{  
					  	tmp1+=motor2.Step_Table[i];
					   	if(tmp1>tmp)
					    {
					     	motor2.CurrentPostion=i;
						 	break; 
					    }
					}
					if(i<18)
					{
					   	motor2.CurrentPostion=18;
					}
					else
					{
					  	motor2.CurrentPostion=i; 
					} 
			  }
			  pos2=motor2.CurrentPostion;
			  TIM2->CR1 |= CR1_CEN_Set;	
		  }
		  if(CollisionIntEnable==TRUE)	  
		  {
		     CollisionIntEnable=FALSE;
//			 motor1.en=0;
//			 motor2.en=0;
//			 motor3.en=0;
//			 motor4.en=0;
//			 TIM_Cmd(TIM3, DISABLE);	
//			 TIM_Cmd(TIM4, DISABLE);
//			 TIM_Cmd(TIM1, DISABLE);
//			 TIM_Cmd(TIM2, DISABLE);
//			 while(1);	
		  }    
	      EXTINum=6;  
   	}
}



