JinxingZhou0510/embedded-source-code/stepmotor-control/bsp/stm32f10x/applications/stm32f10x_itb.c
/*******************************************************************************
* Function Name  : USB_LP_CAN_RX0_IRQHandler
* Description    : This function handles USB Low Priority or CAN RX0 interrupts 
*                  requests.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USB_LP_CAN_RX0_IRQHandler(void)
{
    //CanRxMsg RxMessage;
    uint8_t i,TransmitMailbox;
    unsigned int SendAddr=0;
    unsigned int Serial=0;

    //CAN_Receive(CAN_FIFO0, &RxMessage);
  	/* Get the Id */
	RxMessage.IDE = (u8)0x04 & CAN->sFIFOMailBox[CAN_FIFO0].RIR;
	if (RxMessage.IDE == CAN_ID_STD)
	{
		RxMessage.StdId = (u32)0x000007FF & (CAN->sFIFOMailBox[CAN_FIFO0].RIR >> 21);
	}
	else
	{
		RxMessage.ExtId = (u32)0x1FFFFFFF & (CAN->sFIFOMailBox[CAN_FIFO0].RIR >> 3);
	}   
  	RxMessage.RTR = (u8)0x02 & CAN->sFIFOMailBox[CAN_FIFO0].RIR;  
	/* Get the DLC */
	RxMessage.DLC = (u8)0x0F & CAN->sFIFOMailBox[CAN_FIFO0].RDTR;	
	/* Get the FMI */
	RxMessage.FMI = (u8)0xFF & (CAN->sFIFOMailBox[CAN_FIFO0].RDTR >> 8);

	/* Get the data field */
	RxMessage.Data[0] = (u8)0xFF & CAN->sFIFOMailBox[CAN_FIFO0].RDLR;
	RxMessage.Data[1] = (u8)0xFF & (CAN->sFIFOMailBox[CAN_FIFO0].RDLR >> 8);
	RxMessage.Data[2] = (u8)0xFF & (CAN->sFIFOMailBox[CAN_FIFO0].RDLR >> 16);
	RxMessage.Data[3] = (u8)0xFF & (CAN->sFIFOMailBox[CAN_FIFO0].RDLR >> 24);
	
	RxMessage.Data[4] = (u8)0xFF & CAN->sFIFOMailBox[CAN_FIFO0].RDHR;
	RxMessage.Data[5] = (u8)0xFF & (CAN->sFIFOMailBox[CAN_FIFO0].RDHR >> 8);
	RxMessage.Data[6] = (u8)0xFF & (CAN->sFIFOMailBox[CAN_FIFO0].RDHR >> 16);
	RxMessage.Data[7] = (u8)0xFF & (CAN->sFIFOMailBox[CAN_FIFO0].RDHR >> 24);

  	/* Release the FIFO */
  	//CAN_FIFORelease(CAN_FIFO0); 
  	CAN->RF0R = RF0R_RFOM0;
    SendAddr=RxMessage.ExtId&0x3F;          //低6位为目的地地址
    USART1_Printfstr("\r\nCAN RCV \r\n"); 
    if(SendAddr!=LOCALMODEL)
    {
        USART1_Printfstr("\r\nCAN RCV Wrong ID_1\r\n");   
    }
    if(RxMessage.Data[0]!=LOCALMODEL)
    {
        USART1_Printfstr("\r\nCAN RCV Wrong ID_2\r\n");   
    }          
    Serial=(RxMessage.ExtId&0x3FFFC0)>>6;   //得到序列号
    if(Serial==LastCANSeries)
    {
        //重复包，丢弃
        USART1_Printfstr("\r\nCAN RCV Repeated packets\r\n"); 
        //return;
    }
    LastCANSeries=Serial;
    CurrentCANRxSeries++;
    if(Serial!=CurrentCANRxSeries)
    {
        //丢包处理
         USART1_Printfstr("\r\nCAN Lost packets\r\n"); 
        //此处处理
        
        CurrentCANRxSeries=Serial;    
    }   
    if( (RxMessage.IDE==CAN_ID_EXT)&& (RxMessage.DLC==8) ) //SampleModel 
    {  
	   canrx++;	
	   //如果是主板的应答，则填充完应答帧后直接返回
	    if(RxMessage.Data[1]==0x03)
		{
			AckFram.ModuleNum=RxMessage.Data[0];
			AckFram.DataNature=RxMessage.Data[1];
			AckFram.Cmd=RxMessage.Data[2];
			return ; 
		}   	   
		for(i=0;i<8;i++)
		{
		  CanRevBuff[PReceiveBufferCAN2+i]=RxMessage.Data[i];
		}
		CanRevFlag++;	
        CanRevLen=RxMessage.DLC;
		PReceiveBufferCAN2+=RxMessage.DLC;
		if(PReceiveBufferCAN2>=CANRXBUFSIZE)
		{
		   PReceiveBufferCAN2=0;  
		}
		if(RxMessage.Data[1]==0x02)	           //对于写，回送应答，对于读，这里不做处理，留给应用层
		{
		     if((RxMessage.Data[2]==0x05)||(RxMessage.Data[2]==0x15)||(RxMessage.Data[2]==0x10)||(RxMessage.Data[2]==0x12)||(RxMessage.Data[2]==0x08)||(RxMessage.Data[2]==0x18)||(RxMessage.Data[2]==0xF0))	   //对于5、15号命令，是回读校验,数据拷贝，数据取消，这里不做应答
			    return;
            RxMessage.Data[0]=localaddr;  
	 	    RxMessage.Data[1]=0x11;
		    CAN_SendData(RxMessage.Data,8,PACKETS_TYPE_NORMAL);		
		}
	    if(RxMessage.Data[1]==0x03)	           //主板回送应答处理
		{
		     if((RxMessage.Data[2]==0x13)||(RxMessage.Data[2]==0x23))	   //对于3号应答命令，即传送结果回送做处理
			 {
			   CuptoTest[RxMessage.Data[3]-1].m_AckFlag++;
			 }		    
		}
	 }//end if	 
}
void USB_HP_CAN_TX_IRQHandler(void)	      
{
   	  uint8_t i = 0;
	  u8 TransmitMailbox = 0;

	   if(PTxBufferCAN1 == PTxBufferCAN2) //数据处理完毕后关中断
	   {
		  //PTxBufferCAN1=PTxBufferCAN2=0;
    	  CAN->IER &= ~CAN_IT_TME;
		  return;
	   } 
	   //以下3句话是清除发送完毕中断，貌似不能清除，否则后面只有发送完毕中断，没办法启动发送了
	  if(RESET!=(CAN->TSR&TSR_RQCP0))
	  {
	  	 CAN->TSR = TSR_RQCP0;
	  }
	  if(RESET!=(CAN->TSR&TSR_RQCP1))
	  {
	  	 CAN->TSR = TSR_RQCP1;
	  }
	  if(RESET!=(CAN->TSR&TSR_RQCP2))
	  {
	  	 CAN->TSR = TSR_RQCP2;
	  }
	  CurrentCANTxSeries++;   
	  TxMessage.ExtId=(CanTxBuff[PTxBufferCAN1+8]<<22)|(CurrentCANTxSeries<<6)|MainModel|localaddr;//MainModel;//LOCALMODEL;		  
	  for(i=0;i<8;i++)
	  {		   
		TxMessage.Data[i]=CanTxBuff[PTxBufferCAN1+i]; 	
	  }	
	  	
	  /* Select one empty transmit mailbox */
	  if ((CAN->TSR&TSR_TME0) == TSR_TME0)
	  {
	    TransmitMailbox = 0;
	  }
	  else if ((CAN->TSR&TSR_TME1) == TSR_TME1)
	  {
	    TransmitMailbox = 1;
	  }
	  else if ((CAN->TSR&TSR_TME2) == TSR_TME2)
	  {
	    TransmitMailbox = 2;
	  }
	  else
	  {
	    TransmitMailbox = CAN_NO_MB;
	  }
	
	  if (TransmitMailbox != CAN_NO_MB)
	  {
	    /* Set up the Id */
	    CAN->sTxMailBox[TransmitMailbox].TIR &= TMIDxR_TXRQ;
	    if (TxMessage.IDE == CAN_ID_STD)
	    {
	      TxMessage.StdId &= (u32)0x000007FF;
	      TxMessage.StdId = TxMessage.StdId << 21;
	      
	      CAN->sTxMailBox[TransmitMailbox].TIR |= (TxMessage.StdId | TxMessage.IDE |
	                                               TxMessage.RTR);
	    }
	    else
	    {
	      TxMessage.ExtId &= (u32)0x1FFFFFFF;
	      TxMessage.ExtId <<= 3;
	
	      CAN->sTxMailBox[TransmitMailbox].TIR |= (TxMessage.ExtId | TxMessage.IDE | 
	                                               TxMessage.RTR);
	    }
	    
	    /* Set up the DLC */
	    TxMessage.DLC &= (u8)0x0000000F;
	    CAN->sTxMailBox[TransmitMailbox].TDTR &= (u32)0xFFFFFFF0;
	    CAN->sTxMailBox[TransmitMailbox].TDTR |= TxMessage.DLC;
	
	    /* Set up the data field */
	    CAN->sTxMailBox[TransmitMailbox].TDLR = (((u32)TxMessage.Data[3] << 24) | 
	                                             ((u32)TxMessage.Data[2] << 16) |
	                                             ((u32)TxMessage.Data[1] << 8) | 
	                                             ((u32)TxMessage.Data[0]));
	    CAN->sTxMailBox[TransmitMailbox].TDHR = (((u32)TxMessage.Data[7] << 24) | 
	                                             ((u32)TxMessage.Data[6] << 16) |
	                                             ((u32)TxMessage.Data[5] << 8) |
	                                             ((u32)TxMessage.Data[4]));
	
