JinxingZhou0510/embedded-source-code/stepmotor-control/bsp/stm32f10x/applications/stm32f10x_itb.c
	    /* Request transmission */
		PTxBufferCAN1+=9; 
		if(PTxBufferCAN1>=CANTXBUFSIZE)
		{
			PTxBufferCAN1=0;	
		}
	    CAN->sTxMailBox[TransmitMailbox].TIR |= TMIDxR_TXRQ;
	  }
   
}
void USART1_IRQHandler(void)
{
 	  u32 usartxbase = 0x00;
	  u32 bitpos = (u32)0x01 << (USART_IT_RXNE >> 0x08), itmask = (u32)0x01 << (USART_IT_RXNE & 0x001F);//usartreg =(((u8)USART_IT_RXNE) >> 0x05);; 
	  
	  //接收中断的处理	 
	  itmask &= USART1->CR1;  
	  bitpos &= USART1->SR;	
	  if ((itmask != (u16)RESET)&&(bitpos != (u16)RESET))
	  {
	    
	    	USART1_RxBuffer[USART1_RxCounter++] = USART1->DR&(u16)0x01FF;
	    	USART1_NbrOfDataReceived++;	
			if(USART1_RxCounter>1&&(USART1_RxBuffer[USART1_RxCounter-1]==0x0a)&&(USART1_RxBuffer[USART1_RxCounter-2]==0x0d))	 
			{
		 		 USART1_Received_Flag=1;
			}  
	  }
  
     //发送中断的处理	 	 	  							  
	  itmask = (u32)0x01 << (USART_IT_TXE & ((u16)0x001F));	 	 
	  itmask &= USART1->CR1;  	
	  bitpos = (u32)0x01 << (USART_IT_TXE >> 0x08);	  
	  bitpos &= USART1->SR;	 

	  if ((itmask != (u16)0)&&(bitpos != (u16)0))
	  { 	   
			USART1->DR =USART1_TxBuffer[PTxBufferUSART11++];
	
	    	if(PTxBufferUSART11 >= PTxBufferUSART12)
	    	{
	     
		  		PTxBufferUSART11=PTxBufferUSART12=0;
				usartxbase=USART1_BASE+0x0C;
				itmask = (((u32)0x01) << (USART_IT_TXE & 0x001F)); 					 				
				*(vu32*)usartxbase &= ~itmask; 		  
	    	} 
		  
	  }  
}
/*******************************************************************************
* Function Name  : USART3_IRQHandler
* Description    : This function handles USART3 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void USART3_IRQHandler(void)
{
     u32 usartxbase=0x0000; 
     u32 bitpos = (u32)0x01 << (USART_IT_RXNE >> 0x08), itmask = (u32)0x01 << (USART_IT_RXNE & 0x001F);
   
     itmask &= USART3->CR1;	
	 bitpos &= USART3->SR;
	
	if(USART_GetITStatus(USART3, USART_IT_PE) != RESET)
    {
    /* Clear the USART1 Receive interrupt */
        USART_ClearITPendingBit(USART3, USART_IT_PE);
		USART3_Received_Error=1;
    }


	 if ((itmask != (u16)RESET)&&(bitpos != (u16)RESET))
	 {
	    USART3_RxBuffer[USART3_RxCounter++] =  USART3->DR&(u16)0x01FF;
        USART3_NbrOfDataReceived++;	
		if(USART3_RxCounter>1&&(USART3_RxBuffer[USART3_RxCounter-1]==0x0d))//&&(USART3_RxBuffer[USART3_RxCounter-2]==0x0d))	 
		{
		  USART3_Received_Flag=1;
		}  
	 }
 
	  //发送中断的处理	 	 	  							  
	  itmask = (u32)0x01 << (USART_IT_TXE & ((u16)0x001F));	 	 
	  itmask &= USART3->CR1;  	
	  bitpos = (u32)0x01 << (USART_IT_TXE >> 0x08);	  
	  bitpos &= USART3->SR;

	 if ((itmask != (u16)RESET)&&(bitpos != (u16)RESET))
	 {   
	    // Write one byte to the transmit data register //
	    //USART_SendData(USART3, USART3_TxBuffer[USART3_TxCounter++]);
		USART3->DR =USART3_TxBuffer[USART3_TxCounter++];
	
	    if(USART3_TxCounter >= USART3_NbrOfDataToTransfer)
	    {		  
		   usartxbase=USART3_BASE+0x0C;
		   itmask = (((u32)0x01) << (USART_IT_TXE & 0x001F)); 
		   *(vu32*)usartxbase &= ~itmask;
	    }    
	 } 
}
/*******************************************************************************
* Function Name  : NMIException
* Description    : This function handles NMI exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void NMIException(void)
{
}

/*******************************************************************************
* Function Name  : HardFaultException
* Description    : This function handles Hard Fault exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void HardFaultException(void)
{
  /* Go to infinite loop when Hard Fault exception occurs */
  while (1)
  {
  }
}

/*******************************************************************************
* Function Name  : MemManageException
* Description    : This function handles Memory Manage exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void MemManageException(void)
{
  /* Go to infinite loop when Memory Manage exception occurs */
  while (1)
  {
  }
}

/*******************************************************************************
* Function Name  : BusFaultException
* Description    : This function handles Bus Fault exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void BusFaultException(void)
{
  /* Go to infinite loop when Bus Fault exception occurs */
  while (1)
  {
  }
}

/*******************************************************************************
* Function Name  : UsageFaultException
* Description    : This function handles Usage Fault exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void UsageFaultException(void)
{
  /* Go to infinite loop when Usage Fault exception occurs */
  while (1)
  {
  }
}

/*******************************************************************************
* Function Name  : DebugMonitor
* Description    : This function handles Debug Monitor exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void DebugMonitor(void)
{
}

/*******************************************************************************
* Function Name  : SVCHandler
* Description    : This function handles SVCall exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SVCHandler(void)
{
}

/*******************************************************************************
* Function Name  : PendSVC
* Description    : This function handles PendSVC exception.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void PendSVC(void)
{
}

